project/src/DataProcessors/НастройкаПравилКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>НастройкаПравилКонвертацииСвойств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертацииОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеСвойств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СоздатьПравило</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвойствоКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвойствоФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСвойстваКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоКонвертации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСвойстваФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сопоставлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоТЧ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвойствоКонфигурацииКорреспондента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСвойстваКонфигурацииКорреспондента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвойствоКонфигурацииСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвойствоКонфигурацииКорреспондентаСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

project/src/Catalogs/Конвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Конвертации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертацией</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертациейОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойУдаления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтложеннымЗаполнением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтправкойИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередПолучениемИзмененныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПравилОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеПолученияИнформацииОбУзлахОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриПолученииИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия82</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоОбъектамВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПереводИменОбъектовФормата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДляСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРазделениеМодуля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТипизациюПеременных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфигурацияКорреспондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайловойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыгрузкиРазделенногоМодуля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиРазделенногоМодуля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияФормата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстанавливатьВДиалоге</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетсяПриЗагрузке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьПараметрПриВыгрузке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоКонвертации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВременнаяКопия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/DataProcessors/НастройкаПравилКонвертацииСвойств/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПравилоКонвертацииОбъекта") Тогда
		Объект.ПравилоКонвертацииОбъекта = Параметры.ПравилоКонвертацииОбъекта;
	КонецЕсли;
	Если Параметры.Свойство("ЭтоКонвертацияXDTO") Тогда
		ЭтоКонвертацияXDTO = Параметры.ЭтоКонвертацияXDTO;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ПравилоКонвертацииОбъекта) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Самостоятельное открытие обработки не предусмотрено'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбновитьТаблицуСопоставления();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьСпискиВыбораСвойств();
	УстановитьДоступность();
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СопоставлениеСвойствСвойствоКонфигурацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеСвойства = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	Элементы.СопоставлениеСвойств.ТекущиеДанные.СвойствоКонфигурации = ПредставлениеСвойства;
	Объект.СопоставлениеСвойств[Элементы.СопоставлениеСвойств.ТекущиеДанные.НомерСтроки - 1].СвойствоКонфигурации = ПредставлениеСвойства;
	Если ЭтоКонвертацияXDTO Тогда
		ОбработатьВыборСвойства("СвойствоКонфигурацииСсылка", "ТипСвойстваКонфигурации", ВыбранноеЗначение, "СвойствоФормата");
	Иначе
		ОбработатьВыборСвойства("СвойствоКонфигурацииСсылка", "ТипСвойстваКонфигурации", ВыбранноеЗначение, "СвойствоКонфигурацииКорреспондента");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСвойствСвойствоКонфигурацииКорреспондентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеСвойства = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	Элементы.СопоставлениеСвойств.ТекущиеДанные.СвойствоКонфигурацииКорреспондента = ПредставлениеСвойства;
	Объект.СопоставлениеСвойств[Элементы.СопоставлениеСвойств.ТекущиеДанные.НомерСтроки - 1].СвойствоКонфигурацииКорреспондента = ПредставлениеСвойства;

	ОбработатьВыборСвойства("СвойствоКонфигурацииКорреспондентаСсылка", "ТипСвойстваКонфигурацииКорреспондента", ВыбранноеЗначение, "СвойствоКонфигурации");
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСвойствСвойствоФорматаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработатьВыборСвойства("СвойствоФормата", "ТипСвойстваФормата", ВыбранноеЗначение, "СвойствоКонфигурации");
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтображенияПриИзменении(Элемент)
	ОбновитьТаблицуСопоставления();
	НастроитьСпискиВыбораСвойств();
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСвойствПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.СопоставлениеСвойств.ТекущиеДанные.Сопоставлено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Автосопоставление(Команда)
	Если Объект.СопоставлениеСвойств.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Отсутствуют свойства для автоматического сопоставления'"));
		Возврат;
	КонецЕсли;
	АвтосопоставлениеСвойств();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПКС(Команда)
	ПравилаКонвертацииСвойств = ПолучитьПравилаКонвертацииСвойств();
	Если ПравилаКонвертацииСвойств.ПКС.Количество() > 0 Тогда
		ПараметрыЗакрытияФормы = Новый Структура();
		ПараметрыЗакрытияФормы.Вставить("ПравилаКонвертацииСвойств", ПравилаКонвертацииСвойств);
		ОповеститьОВыборе(ПараметрыЗакрытияФормы);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуСопоставления()
	Объект.СопоставлениеСвойств.Очистить();
	
	Если ВариантОтображения > 0 Тогда
		ЗаполнитьТаблицуСопоставленныхСвойств();
	КонецЕсли;
	Если ВариантОтображения = 0 ИЛИ ВариантОтображения = 2 Тогда
		Если ЭтоКонвертацияXDTO Тогда
			ЗаполнитьТаблицуНеСопоставленныхСвойствXDTO();
		Иначе
			ЗаполнитьТаблицуНеСопоставленныхСвойствXML()
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНеСопоставленныхСвойствXDTO()
	МассивКонвертаций = Новый Массив;
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.ПравилоКонвертацииОбъекта, МассивКонвертаций);


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЧВерсииФормата.ВерсияФормата КАК ВерсияФормата
	|ПОМЕСТИТЬ ТабВерсииФормата
	|ИЗ
	|	Справочник.Конвертации.ВерсииФормата КАК ТЧВерсииФормата
	|ГДЕ
	|	ТЧВерсииФормата.Ссылка В (&МассивКонвертаций)
	|;
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	СвойствоКонфигурации,
	|	СвойствоФормата,
	|	Родитель,
	|	ЕстьNULL(Родитель.СвойствоФормата, """") КАК РодительСвойствоФормата
	|ПОМЕСТИТЬ ТаблицаПКС
	|ИЗ	Справочник.ПравилаКонвертацииСвойств КАК ПКС
	|ГДЕ ПКС.Владелец = &ПравилоКонвертацииОбъекта
	|;
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрСвойства.Наименование КАК Наименование,
	|	СпрСвойства.Ссылка КАК Ссылка,
	|	СпрСвойства.Родитель КАК Родитель,
	|	ЕстьNULL(СпрСвойства.Родитель.Наименование, """") КАК РодительНаименование,
	|	ВЫБОР КОГДА СпрСвойства.Родитель <> ЗНАЧЕНИЕ(Справочник.СвойстваФормата.ПустаяСсылка) ТОГДА
	|		ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоТЧ,
	|	СпрСвойства.ЭтоГруппа КАК ЭтоГруппа,
	|	ВЫРАЗИТЬ(СпрСвойства.Тип КАК Строка(1000)) КАК Тип
	|ПОМЕСТИТЬ ТаблицаСвойствФормата
	|ИЗ Справочник.СвойстваФормата КАК СпрСвойства
	|ГДЕ СпрСвойства.Владелец.Наименование = &ОбъектФорматаИмя
	|	И СпрСвойства.ПометкаУдаления = ЛОЖЬ
	|	И СпрСвойства.Владелец.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ТабВерсииФормата)
	|	И СпрСвойства.ПометкаУдаления = ЛОЖЬ
	|	И СпрСвойства.ЭтоГруппа = ЛОЖЬ
	|;
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Тип КАК ИмяОбъекта,
	|	Ссылка КАК ОбъектКС
	|ПОМЕСТИТЬ ТабКлючевоеСвойство
	|ИЗ ТаблицаСвойствФормата КАК СвойстваФормата
	|ГДЕ 
	|	СвойстваФормата.Наименование = ""КлючевыеСвойства""
	|	И СвойстваФормата.ЭтоГруппа = ИСТИНА
	|;
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрСвойства.Наименование,
	|	СпрСвойства.Ссылка,
	|	СпрСвойства.Родитель КАК Родитель,
	|	ЕстьNULL(СпрСвойства.Родитель.Наименование, """") КАК РодительНаименование,
	|	ВЫРАЗИТЬ(СпрСвойства.ТипыСтрокой КАК Строка(1000)) КАК ТипыСтрокой,
	|	ВЫБОР КОГДА СпрСвойства.Родитель <> ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка) ТОГДА
	|		ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоТЧ,
	|	Владелец.Владелец КАК Конфигурация
	|ПОМЕСТИТЬ ТаблицаСвойств
	|ИЗ Справочник.Свойства КАК СпрСвойства
	|ГДЕ Владелец = &ОбъектКонфигурации
	|	И ПометкаУдаления = ЛОЖЬ И СпрСвойства.ЭтоГруппа = ЛОЖЬ
	|	И (
	|		(СпрСвойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка))
	|		ИЛИ (СпрСвойства.Родитель <> ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка) И СпрСвойства.Родитель.Вид = &ВидТЧ)
	|	)
	|;
	|//////////////////////////////////////////////////////////////////////////////////
	// Свойства конфигурации - реквизиты шапки
	|ВЫБРАТЬ
	|	СпрСвойства.Наименование КАК СвойствоКонфигурации,
	|	"""" 					КАК СвойствоКонфигурацииРодитель,
	|	СпрСвойства.Ссылка КАК СвойствоКонфигурацииСсылка,
	|	СпрСвойства.ТипыСтрокой КАК ТипСвойстваКонфигурации,
	|	NULL КАК СвойствоФормата,
	|	NULL КАК СвойствоФорматаРодитель,
	|	NULL КАК СвойствоФорматаРодительСсылка,
	|	NULL КАК ТипСвойстваФормата,
	|	ЛОЖЬ КАК ЭтоТЧ
	|ИЗ ТаблицаСвойств КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоКонфигурации = СпрСвойства.Ссылка
	|ГДЕ ПКС.СвойствоФормата ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	// Свойства формата - реквизиты шапки
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СпрСвойства.Наименование,
	|	"""",
	|	NULL,
	|	Максимум(СпрСвойства.Тип),
	|	ЛОЖЬ
	|ИЗ ТаблицаСвойствФормата КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоФормата = СпрСвойства.Наименование
	|	И ПКС.Родитель = ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
	|ГДЕ ПКС.СвойствоКонфигурации ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	СпрСвойства.Наименование
	|ОБЪЕДИНИТЬ ВСЕ
	// Свойства формата входящие в состав ключевых свойств
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СпрСвойства.Наименование,
	|	"""",
	|	NULL,
	|	Максимум(ВЫРАЗИТЬ(СпрСвойства.Тип КАК Строка(1000))),
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.СвойстваФормата КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоФормата = СпрСвойства.Наименование
	|ГДЕ
	|	ВЫРАЗИТЬ(СпрСвойства.Родитель.Тип КАК Строка(1000)) В (ВЫБРАТЬ ИмяОбъекта ИЗ ТабКлючевоеСвойство)
	|	И СпрСвойства.ПометкаУдаления = ЛОЖЬ
	|	И СпрСвойства.Владелец.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ТабВерсииФормата)
	|	И ПКС.СвойствоКонфигурации ЕСТЬ NULL
	|	И НЕ (СпрСвойства.ЭтоГруппа ИЛИ СпрСвойства.Родитель = ЗНАЧЕНИЕ(Справочник.СвойстваФормата.ПустаяСсылка))
	|СГРУППИРОВАТЬ ПО
	|	СпрСвойства.Наименование
	|ОБЪЕДИНИТЬ ВСЕ
	// Свойства конфигурации - реквизиты ТЧ
	|ВЫБРАТЬ
	|	СпрСвойства.Наименование КАК СвойствоКонфигурации,
	|	СпрСвойства.РодительНаименование КАК СвойствоКонфигурацииРодитель,
	|	СпрСвойства.Ссылка КАК СвойствоКонфигурацииСсылка,
	|	СпрСвойства.ТипыСтрокой КАК ТипСвойстваКонфигурации,
	|	NULL КАК СвойствоФормата,
	|	NULL КАК СвойствоФорматаРодитель,
	|	NULL КАК СвойствоФорматаРодительСсылка,
	|	NULL КАК ТипСвойстваФормата,
	|	ИСТИНА КАК ЭтоТЧ
	|ИЗ ТаблицаСвойств КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоКонфигурации = СпрСвойства.Ссылка
	|ГДЕ ПКС.СвойствоФормата ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	// Свойства формата - реквизиты ТЧ
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СпрСвойства.Наименование,
	|	СпрСвойства.РодительНаименование,
	|	СпрСвойства.Родитель,
	|	Максимум(СпрСвойства.Тип),
	|	ИСТИНА
	|ИЗ ТаблицаСвойствФормата КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоФормата = СпрСвойства.Наименование
	|	И ПКС.Родитель <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
	|	И ПКС.РодительСвойствоФормата = СпрСвойства.РодительНаименование
	|ГДЕ НЕ (СпрСвойства.Ссылка В ИЕРАРХИИ (ВЫБРАТЬ ОбъектКС ИЗ ТабКлючевоеСвойство))
	|	И ПКС.СвойствоКонфигурации ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ИСТИНА
	|СГРУППИРОВАТЬ ПО
	|	СпрСвойства.РодительНаименование,
	|	СпрСвойства.Родитель,
	|	СпрСвойства.Наименование
	|";
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПравилоКонвертацииОбъекта, "ОбъектКонфигурации, ОбъектФормата");

	Запрос.УстановитьПараметр("ПравилоКонвертацииОбъекта", Объект.ПравилоКонвертацииОбъекта);
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ДанныеПКО.ОбъектКонфигурации);
	Запрос.УстановитьПараметр("ОбъектФорматаИмя", ДанныеПКО.ОбъектФормата);
	Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
	Запрос.УстановитьПараметр("ВидТЧ", Перечисления.ВидыСвойств.ТабличнаяЧасть);

	ТаблицаНесопоставленныхСвойств = Запрос.Выполнить().Выгрузить();
	
	СписокСвойствКонфигурации.Очистить();
	СписокСвойствФормата.Очистить();
	// Заполнение имен родителей через точку

	Для Каждого СтрокаСвойств Из ТаблицаНесопоставленныхСвойств Цикл
		Если СтрокаСвойств.ЭтоТЧ Тогда
			Если ЗначениеЗаполнено(СтрокаСвойств.СвойствоКонфигурацииРодитель) Тогда
				СтрокаСвойств.СвойствоКонфигурации = СокрЛП(СтрокаСвойств.СвойствоКонфигурацииРодитель) + "." + СокрЛП(СтрокаСвойств.СвойствоКонфигурации);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаСвойств.СвойствоФорматаРодительСсылка) Тогда
				ИмяРодителяРекурсивно = ВерхнийРодительИмя(СтрокаСвойств.СвойствоФорматаРодительСсылка);
				Если ЗначениеЗаполнено(ИмяРодителяРекурсивно) Тогда
					СтрокаСвойств.СвойствоФормата = ИмяРодителяРекурсивно + "." + СокрЛП(СтрокаСвойств.СвойствоФормата);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если СокрЛП(СтрокаСвойств.СвойствоКонфигурации) <> "" Тогда
			СписокСвойствКонфигурации.Добавить(СтрокаСвойств.СвойствоКонфигурацииСсылка, СтрокаСвойств.СвойствоКонфигурации);
		КонецЕсли;
	КонецЦикла;
	ТаблицаНесопоставленныхСвойств.Свернуть("СвойствоКонфигурации, СвойствоКонфигурацииСсылка, СвойствоКонфигурацииРодитель, ТипСвойстваКонфигурации, СвойствоФормата, СвойствоФорматаРодитель, ТипСвойстваФормата, ЭтоТЧ");
	ТаблицаНесопоставленныхСвойств.Сортировать("ЭтоТЧ ВОЗР, СвойствоФормата ВОЗР, СвойствоКонфигурации ВОЗР");
	Для Каждого СтрокаСвойств Из ТаблицаНесопоставленныхСвойств Цикл
		Если СокрЛП(СтрокаСвойств.СвойствоФормата) <> "" Тогда
			СписокСвойствФормата.Добавить(СтрокаСвойств.СвойствоФормата);
		КонецЕсли;
		СтрокаСвойствНовая = Объект.СопоставлениеСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСвойствНовая, СтрокаСвойств);
	КонецЦикла;
	СписокСвойствКонфигурации.СортироватьПоПредставлению();
	СписокСвойствФормата.СортироватьПоЗначению();
	Объект.СопоставлениеСвойств.Сортировать("ЭтоТЧ Возр, СвойствоФормата ВОЗР, СвойствоКонфигурации ВОЗР");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНеСопоставленныхСвойствXML()
	МассивКонвертаций = Новый Массив;
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.ПравилоКонвертацииОбъекта, МассивКонвертаций);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СпрСвойства.Наименование,
	|	СпрСвойства.Ссылка,
	|	ЕстьNULL(СпрСвойства.Родитель.Наименование, """") КАК РодительНаименование,
	|	ВЫРАЗИТЬ(СпрСвойства.ТипыСтрокой КАК Строка(1000)) КАК ТипыСтрокой,
	|	ВЫБОР КОГДА СпрСвойства.Родитель <> ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка) ТОГДА
	|		ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоТЧ,
	|	Владелец.Владелец КАК Конфигурация
	|ПОМЕСТИТЬ ТаблицаСвойств
	|ИЗ Справочник.Свойства КАК СпрСвойства
	|ГДЕ Владелец = &ОбъектКонфигурации
	|	И ПометкаУдаления = ЛОЖЬ И ЭтоГруппа = ЛОЖЬ
	|	И (
	|		(СпрСвойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка))
	|		ИЛИ (СпрСвойства.Родитель <> ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка))
	|	)
	|;
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрСвойства.Наименование,
	|	СпрСвойства.Ссылка,
	|	ЕстьNULL(СпрСвойства.Родитель.Наименование, """") КАК РодительНаименование,
	|	ВЫРАЗИТЬ(СпрСвойства.ТипыСтрокой КАК Строка(1000)) КАК ТипыСтрокой,
	|	ВЫБОР КОГДА СпрСвойства.Родитель <> ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка) ТОГДА
	|		ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоТЧ,
	|	Владелец.Владелец КАК Конфигурация
	|ПОМЕСТИТЬ ТаблицаСвойствКорреспондента
	|ИЗ Справочник.Свойства КАК СпрСвойства
	|ГДЕ Владелец = &ОбъектКонфигурацииКорреспондент
	|	И ПометкаУдаления = ЛОЖЬ И ЭтоГруппа = ЛОЖЬ
	|	И (
	|		(СпрСвойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка))
	|		ИЛИ (СпрСвойства.Родитель <> ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка))
	|	)
	|;
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	СвойствоКонфигурации,
	|	СвойствоКонфигурацииКорреспондента,
	|	Родитель
	|ПОМЕСТИТЬ ТаблицаПКС
	|ИЗ	Справочник.ПравилаКонвертацииСвойств КАК ПКС
	|ГДЕ ПКС.Владелец = &ПравилоКонвертацииОбъекта
	|;
	|//////////////////////////////////////////////////////////////////////////////////  
	// Свойства конфигурации - реквизиты шапки
	|ВЫБРАТЬ
	|	СпрСвойства.Наименование КАК СвойствоКонфигурации,
	|	"""" КАК СвойствоКонфигурацииРодитель,
	|	СпрСвойства.Ссылка КАК СвойствоКонфигурацииСсылка,
	|	СпрСвойства.ТипыСтрокой КАК ТипСвойстваКонфигурации,
	|	NULL КАК СвойствоКонфигурацииКорреспондента,
	|	NULL КАК СвойствоКонфигурацииКорреспондентаРодитель,
	|	NULL КАК ТипСвойстваКонфигурацииКорреспондента,
	|	NULL КАК СвойствоКонфигурацииКорреспондентаСсылка,
	|	ЛОЖЬ КАК ЭтоТЧ
	|ИЗ ТаблицаСвойств КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоКонфигурации = СпрСвойства.Ссылка
	|ГДЕ ПКС.СвойствоКонфигурацииКорреспондента ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	// Свойства конфигурации корреспондента - реквизиты шапки
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СпрСвойства.Наименование,
	|	"""",
	|	СпрСвойства.ТипыСтрокой,
	|	СпрСвойства.Ссылка,
	|	ЛОЖЬ
	|ИЗ ТаблицаСвойствКорреспондента КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоКонфигурацииКорреспондента = СпрСвойства.Ссылка
	|ГДЕ ПКС.СвойствоКонфигурации ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	// Свойства конфигурации - реквизиты ТЧ
	|ВЫБРАТЬ
	|	СпрСвойства.Наименование КАК СвойствоКонфигурации,
	|	СпрСвойства.РодительНаименование КАК СвойствоКонфигурацииРодитель,
	|	СпрСвойства.Ссылка КАК СвойствоКонфигурацииСсылка,
	|	СпрСвойства.ТипыСтрокой КАК ТипСвойстваКонфигурации,
	|	NULL КАК СвойствоКонфигурацииКорреспондента,
	|	NULL КАК СвойствоКонфигурацииКорреспондентаРодитель,
	|	NULL КАК ТипСвойстваКонфигурацииКорреспондента,
	|	NULL КАК СвойствоКонфигурацииКорреспондентаСсылка,
	|	ИСТИНА КАК ЭтоТЧ
	|ИЗ ТаблицаСвойств КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоКонфигурации = СпрСвойства.Ссылка
	|ГДЕ ПКС.СвойствоКонфигурацииКорреспондента ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	// Свойства конфигурации корреспондента - реквизиты ТЧ
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СпрСвойства.Наименование,
	|	СпрСвойства.РодительНаименование,
	|	СпрСвойства.ТипыСтрокой,
	|	СпрСвойства.Ссылка,
	|	ИСТИНА КАК ЭтоТЧ
	|ИЗ ТаблицаСвойствКорреспондента КАК СпрСвойства
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	ТаблицаПКС КАК ПКС
	|ПО ПКС.СвойствоКонфигурации = СпрСвойства.Ссылка
	|ГДЕ ПКС.СвойствоКонфигурации ЕСТЬ NULL
	|	И СпрСвойства.ЭтоТЧ = ИСТИНА
	|";
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПравилоКонвертацииОбъекта, "ОбъектКонфигурации, ОбъектКонфигурацииКорреспондент");
	Запрос.УстановитьПараметр("ПравилоКонвертацииОбъекта", Объект.ПравилоКонвертацииОбъекта);
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ДанныеПКО.ОбъектКонфигурации);
	Запрос.УстановитьПараметр("ОбъектКонфигурацииКорреспондент", ДанныеПКО.ОбъектКонфигурацииКорреспондент);

	ТаблицаНесопоставленныхСвойств = Запрос.Выполнить().Выгрузить();
	ТаблицаНесопоставленныхСвойств.Сортировать("ЭтоТЧ ВОЗР, СвойствоКонфигурацииКорреспондента ВОЗР, СвойствоКонфигурации ВОЗР");
	
	СписокСвойствКонфигурации.Очистить();
	СписокСвойствФормата.Очистить();

	Для Каждого СтрокаСвойств Из ТаблицаНесопоставленныхСвойств Цикл
		Если СтрокаСвойств.ЭтоТЧ Тогда
			Если ЗначениеЗаполнено(СтрокаСвойств.СвойствоКонфигурацииРодитель) Тогда
				СтрокаСвойств.СвойствоКонфигурации = СокрЛП(СтрокаСвойств.СвойствоКонфигурацииРодитель) + "." + СокрЛП(СтрокаСвойств.СвойствоКонфигурации);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаСвойств.СвойствоКонфигурацииКорреспондентаРодитель) Тогда
				СтрокаСвойств.СвойствоКонфигурацииКорреспондента = 
					СокрЛП(СтрокаСвойств.СвойствоКонфигурацииКорреспондентаРодитель) + "." + СокрЛП(СтрокаСвойств.СвойствоКонфигурацииКорреспондента);
			КонецЕсли;
		КонецЕсли;

		Если СокрЛП(СтрокаСвойств.СвойствоКонфигурации) <> "" Тогда
			СписокСвойствКонфигурации.Добавить(СтрокаСвойств.СвойствоКонфигурацииСсылка, СтрокаСвойств.СвойствоКонфигурации);
		КонецЕсли;
		Если СокрЛП(СтрокаСвойств.СвойствоКонфигурацииКорреспондента) <> "" Тогда
			СписокСвойствКонфигурацииКорреспондента.Добавить(СтрокаСвойств.СвойствоКонфигурацииКорреспондентаСсылка, СтрокаСвойств.СвойствоКонфигурацииКорреспондента);
		КонецЕсли;
		СтрокаСвойствНовая = Объект.СопоставлениеСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСвойствНовая, СтрокаСвойств);
	КонецЦикла;
	СписокСвойствКонфигурации.СортироватьПоПредставлению();
	СписокСвойствКонфигурацииКорреспондента.СортироватьПоПредставлению();
	Объект.СопоставлениеСвойств.Сортировать("ЭтоТЧ ВОЗР, СвойствоКонфигурацииКорреспондента ВОЗР, СвойствоКонфигурации ВОЗР");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСопоставленныхСвойств()
	Запрос = Новый Запрос;
	Если ЭтоКонвертацияXDTO Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|ПолноеИмяСвойстваКонфигурации КАК СвойствоКонфигурации,
		|СвойствоКонфигурации.Родитель КАК СвойствоКонфигурацииРодительСсылка,
		|СвойствоКонфигурации КАК СвойствоКонфигурацииСсылка,
		|ПолноеИмяСвойстваФормата КАК СвойствоФормата,
		|ТипСвойстваКонфигурации,
		|ТипСвойстваФормата,
		|Родитель <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка) КАК ЭтоТЧ,
		|ИСТИНА КАК Сопоставлено
		|ИЗ Справочник.ПравилаКонвертацииСвойств
		|ГДЕ Владелец = &ПравилоКонвертацииОбъекта И ЭтоГруппа = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО ПолноеИмяСвойстваФормата ВОЗР";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|ПолноеИмяСвойстваКонфигурации КАК СвойствоКонфигурации,
		|СвойствоКонфигурации.Родитель КАК СвойствоКонфигурацииРодительСсылка,
		|СвойствоКонфигурации КАК СвойствоКонфигурацииСсылка,
		|ПолноеИмяСвойстваКонфигурацииКорреспондента КАК СвойствоКонфигурацииКорреспондента,
		|СвойствоКонфигурацииКорреспондента КАК СвойствоКонфигурацииКорреспондентаСсылка,
		|СвойствоКонфигурацииКорреспондента.Родитель КАК СвойствоКонфигурацииКорреспондентаРодительСсылка,
		|ТипСвойстваКонфигурации,
		|ТипСвойстваКонфигурацииКорреспондента,
		|Родитель <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка) КАК ЭтоТЧ,
		|ИСТИНА КАК Сопоставлено
		|ИЗ Справочник.ПравилаКонвертацииСвойств
		|ГДЕ Владелец = &ПравилоКонвертацииОбъекта И ЭтоГруппа = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО ПолноеИмяСвойстваКонфигурации ВОЗР";
	КонецЕсли;
	Запрос.УстановитьПараметр("ПравилоКонвертацииОбъекта", Объект.ПравилоКонвертацииОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСвойствНовая = Объект.СопоставлениеСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСвойствНовая, Выборка);
		Если ЗначениеЗаполнено(Выборка.СвойствоКонфигурацииСсылка) И НЕ ЗначениеЗаполнено(Выборка.СвойствоКонфигурации) Тогда
			 СтрокаСвойствНовая.СвойствоКонфигурации = СокрЛП(Выборка.СвойствоКонфигурацииСсылка);
			 Если ЗначениеЗаполнено(Выборка.СвойствоКонфигурацииРодительСсылка) Тогда
				 СтрокаСвойствНовая.СвойствоКонфигурации = СокрЛП(Выборка.СвойствоКонфигурацииРодительСсылка) + "." + СтрокаСвойствНовая.СвойствоКонфигурации;
			 КонецЕсли;
		 КонецЕсли;
		 Если НЕ ЭтоКонвертацияXDTO И ЗначениеЗаполнено(Выборка.СвойствоКонфигурацииКорреспондентаСсылка) И НЕ ЗначениеЗаполнено(Выборка.СвойствоКонфигурацииКорреспондента) Тогда
			 СтрокаСвойствНовая.СвойствоКонфигурацииКорреспондента = СокрЛП(Выборка.СвойствоКонфигурацииКорреспондентаСсылка);
			 Если ЗначениеЗаполнено(Выборка.СвойствоКонфигурацииКорреспондентаРодительСсылка) Тогда
				 СтрокаСвойствНовая.СвойствоКонфигурацииКорреспондента = СокрЛП(Выборка.СвойствоКонфигурацииКорреспондентаРодительСсылка) + "." + СтрокаСвойствНовая.СвойствоКонфигурацииКорреспондента;
			 КонецЕсли;
		 КонецЕсли;
	КонецЦикла; 	
КонецПроцедуры

&НаСервере
Процедура АвтосопоставлениеСвойств()
	МассивСтрокКУдалению = Новый Массив;
	ТаблицаСопоставления = Объект.СопоставлениеСвойств.Выгрузить();
	СвойстваДляКопирования = "";
	Если ЭтоКонвертацияXDTO Тогда
		ИмяКоррСвойства = "СвойствоФормата";
		ТипКоррСвойства = "ТипСвойстваФормата";
		СвойстваДляКопирования = "" + ИмяКоррСвойства + "," + ТипКоррСвойства;
	Иначе
		ИмяКоррСвойства = "СвойствоКонфигурацииКорреспондента";
		ТипКоррСвойства = "ТипСвойстваКонфигурацииКорреспондента";
		СвойстваДляКопирования = "" + ИмяКоррСвойства + "," + ТипКоррСвойства + "," + ИмяКоррСвойства + "Ссылка";
	КонецЕсли;
	// Шаг1. Предопределенные сопоставления
	СтрокаКонфигурации = ТаблицаСопоставления.Найти("Родитель", "СвойствоКонфигурации");
	Если СтрокаКонфигурации <> Неопределено И НЕ СтрокаКонфигурации.Сопоставлено Тогда
		СтрокаКорреспондента = ТаблицаСопоставления.Найти("Группа", ИмяКоррСвойства);
		Если СтрокаКорреспондента <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаКонфигурации, СтрокаКорреспондента, СвойстваДляКопирования);
			СтрокаКонфигурации.СоздатьПравило = Истина;
			МассивСтрокКУдалению.Добавить(СтрокаКорреспондента);
		КонецЕсли;
	КонецЕсли;
	СтрокаКонфигурации = ТаблицаСопоставления.Найти("Код", "СвойствоКонфигурации");
	Если СтрокаКонфигурации <> Неопределено И НЕ СтрокаКонфигурации.Сопоставлено Тогда
		СтрокаКорреспондента = ТаблицаСопоставления.Найти("КодВПрограмме", ИмяКоррСвойства);
		Если СтрокаКорреспондента <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаКонфигурации, СтрокаКорреспондента, СвойстваДляКопирования);
			СтрокаКонфигурации.СоздатьПравило = Истина;
			МассивСтрокКУдалению.Добавить(СтрокаКорреспондента);
		КонецЕсли;
	КонецЕсли;
	
	// Шаг2. Сопоставление по имени
	Для Каждого СтрокаСопоставление Из ТаблицаСопоставления Цикл
		Если СтрокаСопоставление.СоздатьПравило ИЛИ СтрокаСопоставление.Сопоставлено Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(СтрокаСопоставление.СвойствоКонфигурации) <> ""
			И СокрЛП(СтрокаСопоставление[ИмяКоррСвойства]) = "" Тогда
			СтруктураПоиска = Новый Структура("СвойствоКонфигурации, Сопоставлено, "+ИмяКоррСвойства, "", Ложь, СокрЛП(СтрокаСопоставление.СвойствоКонфигурации));
			СтрокиКорреспондента = ТаблицаСопоставления.НайтиСтроки(СтруктураПоиска);
			Если СтрокиКорреспондента.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого ПодходящаяСтрока Из СтрокиКорреспондента Цикл
				Если МассивСтрокКУдалению.Найти(ПодходящаяСтрока) = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(СтрокаСопоставление, ПодходящаяСтрока, СвойстваДляКопирования);
					СтрокаСопоставление.СоздатьПравило = Истина;
					МассивСтрокКУдалению.Добавить(ПодходящаяСтрока);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементМассива Из МассивСтрокКУдалению Цикл
		ТаблицаСопоставления.Удалить(ЭлементМассива);
	КонецЦикла;
	МассивСтрокКУдалению.Очистить();
	СтруктураПоиска = Новый Структура("СвойствоКонфигурации, Сопоставлено", "", Ложь);
	СтрокиКорреспондента = ТаблицаСопоставления.НайтиСтроки(СтруктураПоиска);
	Если СтрокиКорреспондента.Количество() = 0 Тогда
		ТаблицаСопоставления.Сортировать("Сопоставлено убыв, СоздатьПравило убыв, СвойствоКонфигурации возр");
		Объект.СопоставлениеСвойств.Загрузить(ТаблицаСопоставления);
		Возврат;
	КонецЕсли;
	
	// Шаг3. Сопоставление по ссылочному типу - шапка
	Для Каждого СтрокаСопоставление Из ТаблицаСопоставления Цикл
		Если СтрокаСопоставление.СоздатьПравило Или СтрокаСопоставление.Сопоставлено Или СтрокаСопоставление.ЭтоТЧ Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(СтрокаСопоставление.СвойствоКонфигурации) <> ""
			И СокрЛП(СтрокаСопоставление[ИмяКоррСвойства]) = "" Тогда
			
			ПозицияТочки = Найти(СтрокаСопоставление.ТипСвойстваКонфигурации,".");
			Если ПозицияТочки = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПодстрокаТип = Прав(СокрЛП(СтрокаСопоставление.ТипСвойстваКонфигурации), СтрДлина(СокрЛП(СтрокаСопоставление.ТипСвойстваКонфигурации))-ПозицияТочки);
			
			Для Каждого СтрокаКорреспондента Из СтрокиКорреспондента Цикл
				Если Найти(СтрокаКорреспондента[ТипКоррСвойства], ПодстрокаТип) > 0
					И МассивСтрокКУдалению.Найти(СтрокаКорреспондента) = Неопределено 
					И НЕ СтрокаКорреспондента.Сопоставлено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаСопоставление, СтрокаКорреспондента, СвойстваДляКопирования);
					СтрокаСопоставление.СоздатьПравило = Истина;
					МассивСтрокКУдалению.Добавить(СтрокаКорреспондента);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	// Шаг4. Сопоставление по ссылочному типу - ТЧ
	Для Каждого СтрокаСопоставление Из ТаблицаСопоставления Цикл
		Если СтрокаСопоставление.СоздатьПравило Или СтрокаСопоставление.Сопоставлено Или НЕ СтрокаСопоставление.ЭтоТЧ Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(СтрокаСопоставление.СвойствоКонфигурации) <> ""
			И СокрЛП(СтрокаСопоставление[ИмяКоррСвойства]) = "" Тогда
			ПозицияТочки = Найти(СтрокаСопоставление.ТипСвойстваКонфигурации,".");
			Если ПозицияТочки = 0 Тогда
				Продолжить;
			КонецЕсли;
			ПодстрокаТип = Прав(СокрЛП(СтрокаСопоставление.ТипСвойстваКонфигурации), СтрДлина(СокрЛП(СтрокаСопоставление.ТипСвойстваКонфигурации))-ПозицияТочки);
			ПозицияТочки = Найти(СтрокаСопоставление.СвойствоКонфигурации,".");
			Если ПозицияТочки = 0 Тогда
				Продолжить;
			КонецЕсли;
			ИмяТЧ = Лев(СокрЛП(СтрокаСопоставление.СвойствоКонфигурации), ПозицияТочки);
			Для Каждого СтрокаКорреспондента Из СтрокиКорреспондента Цикл
				Если Лев(СтрокаКорреспондента[ИмяКоррСвойства], СтрДлина(ИмяТЧ)) <> ИмяТЧ Тогда
					Продолжить;
				ИначеЕсли Найти(СтрокаКорреспондента[ТипКоррСвойства], ПодстрокаТип) > 0
					И МассивСтрокКУдалению.Найти(СтрокаКорреспондента) = Неопределено 
					И НЕ СтрокаКорреспондента.Сопоставлено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаСопоставление, СтрокаКорреспондента, СвойстваДляКопирования);
					СтрокаСопоставление.СоздатьПравило = Истина;
					МассивСтрокКУдалению.Добавить(СтрокаКорреспондента);
					Прервать;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из МассивСтрокКУдалению Цикл
		ТаблицаСопоставления.Удалить(ЭлементМассива);
	КонецЦикла;
	ТаблицаСопоставления.Сортировать("Сопоставлено убыв, СоздатьПравило убыв, СвойствоКонфигурации возр");
	Объект.СопоставлениеСвойств.Загрузить(ТаблицаСопоставления);
КонецПроцедуры

&НаСервере
Функция ПолучитьПравилаКонвертацииСвойств()
	МассивПКС = Новый Массив();
	МассивПКГС = Новый Массив();
	ТаблицаПКГС = Новый ТаблицаЗначений;
	ТаблицаПКГС.Колонки.Добавить("Источник");
	ТаблицаПКГС.Колонки.Добавить("Получатель");

	Для Каждого СтрокаСопоставления Из Объект.СопоставлениеСвойств Цикл
		Если НЕ СтрокаСопоставления.СоздатьПравило ИЛИ СтрокаСопоставления.Сопоставлено Тогда
			Продолжить;
		КонецЕсли;
		СтруктураДанныхСтроки = Новый Структура;
		СтруктураДанныхСтроки.Вставить("Отключить");
		СтруктураДанныхСтроки.Вставить("ИспользуетсяАлгоритмКонвертации");
		СтруктураДанныхСтроки.Вставить("Комментарий");
		СтруктураДанныхСтроки.Вставить("СвойствоКонфигурации");
		СтруктураДанныхСтроки.Вставить("СвойствоКонфигурацииКорреспондента");
		СтруктураДанныхСтроки.Вставить("СвойствоФормата");
		СтруктураДанныхСтроки.Вставить("ТипСвойстваКонфигурации");
		СтруктураДанныхСтроки.Вставить("ТипСвойстваКонфигурацииКорреспондента");
		СтруктураДанныхСтроки.Вставить("ТипСвойстваФормата");
		СтруктураДанныхСтроки.Вставить("ПолноеИмяСвойстваКонфигурации");
		СтруктураДанныхСтроки.Вставить("ПолноеИмяСвойстваКонфигурацииКорреспондента");
		СтруктураДанныхСтроки.Вставить("ПолноеИмяСвойстваФормата");
		СтруктураДанныхСтроки.Вставить("ПравилоКонвертацииСвойства");
		СтруктураДанныхСтроки.Вставить("ГруппаСвойствФормата");
		СтруктураДанныхСтроки.Вставить("ГруппаСвойствКонфигурации");
		СтруктураДанныхСтроки.Вставить("ГруппаСвойствКонфигурацииКорреспондента");

		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, СтрокаСопоставления,,"СвойствоКонфигурации, СвойствоКонфигурацииКорреспондента");
		СтруктураДанныхСтроки.СвойствоКонфигурации = СтрокаСопоставления.СвойствоКонфигурацииСсылка;
		СтруктураДанныхСтроки.СвойствоКонфигурацииКорреспондента = СтрокаСопоставления.СвойствоКонфигурацииКорреспондентаСсылка;
		// Табличная Часть
		Если НЕ ПустаяСтрока(СтрокаСопоставления.СвойствоФормата) Тогда
			ПозицияТочки = Найти(СтрокаСопоставления.СвойствоФормата, ".");
			Если ПозицияТочки > 0 Тогда
				СтруктураДанныхСтроки.СвойствоФормата = Сред(СтрокаСопоставления.свойствоФормата, ПозицияТочки + 1);
				СтруктураДанныхСтроки.ГруппаСвойствФормата = Лев(СтрокаСопоставления.свойствоФормата, ПозицияТочки -1);
			КонецЕсли;
			СтруктураДанныхСтроки.ПолноеИмяСвойстваФормата = СтрокаСопоставления.СвойствоФормата;
		КонецЕсли;
		Если НЕ ПустаяСтрока(СтрокаСопоставления.СвойствоКонфигурацииКорреспондента) Тогда
			ПозицияТочки = Найти(СтрокаСопоставления.СвойствоКонфигурацииКорреспондента, ".");
			Если ПозицияТочки > 0 Тогда
				РодительСвойства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСопоставления.СвойствоКонфигурацииКорреспондентаСсылка, "Родитель");
				СтруктураДанныхСтроки.ГруппаСвойствКонфигурацииКорреспондента = РодительСвойства;
			КонецЕсли;
			СтруктураДанныхСтроки.ПолноеИмяСвойстваКонфигурацииКорреспондента = СтрокаСопоставления.СвойствоКонфигурацииКорреспондента;
		КонецЕсли;
		ПозицияТочки = Найти(СтрокаСопоставления.СвойствоКонфигурации, ".");
		Если ПозицияТочки > 0 Тогда
			РодительСвойства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСопоставления.СвойствоКонфигурацииСсылка, "Родитель");
			СтруктураДанныхСтроки.ГруппаСвойствКонфигурации = РодительСвойства;
		КонецЕсли;
		СтруктураДанныхСтроки.ПолноеИмяСвойстваКонфигурации = СтрокаСопоставления.СвойствоКонфигурации;
		
		Если ЭтоКонвертацияXDTO И (ПустаяСтрока(СтруктураДанныхСтроки.СвойствоКонфигурации) 
			Или ПустаяСтрока(СтруктураДанныхСтроки.СвойствоФормата)) Тогда
			СтруктураДанныхСтроки.ИспользуетсяАлгоритмКонвертации = Истина;
		КонецЕсли;
		МассивПКС.Добавить(СтруктураДанныхСтроки);
		Если ЭтоКонвертацияXDTO Тогда
			Если НЕ ПустаяСтрока(СтруктураДанныхСтроки.ГруппаСвойствФормата) Или НЕ ПустаяСтрока(СтруктураДанныхСтроки.ГруппаСвойствКонфигурации) Тогда
				СтрокаПКГС = ТаблицаПКГС.Добавить();
				СтрокаПКГС.Источник = СтруктураДанныхСтроки.ГруппаСвойствКонфигурации;
				СтрокаПКГС.Получатель = СтруктураДанныхСтроки.ГруппаСвойствФормата;
			КонецЕсли;
		Иначе
			Если НЕ ПустаяСтрока(СтруктураДанныхСтроки.ГруппаСвойствКонфигурацииКорреспондента) Или НЕ ПустаяСтрока(СтруктураДанныхСтроки.ГруппаСвойствКонфигурации) Тогда
				СтрокаПКГС = ТаблицаПКГС.Добавить();
				СтрокаПКГС.Источник = СтруктураДанныхСтроки.ГруппаСвойствКонфигурации;
				СтрокаПКГС.Получатель = СтруктураДанныхСтроки.ГруппаСвойствКонфигурацииКорреспондента;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТаблицаПКГС.Свернуть("Источник, Получатель");
	Для Каждого СтрокаПКГС Из ТаблицаПКГС Цикл
		Если ЭтоКонвертацияXDTO Тогда
			СтруктураДанныхСтроки = Новый Структура("СвойствоКонфигурации, СвойствоФормата",
				СтрокаПКГС.Источник, СтрокаПКГС.Получатель);
		Иначе
			СтруктураДанныхСтроки = Новый Структура("СвойствоКонфигурации, СвойствоКонфигурацииКорреспондента",
				СтрокаПКГС.Источник, СтрокаПКГС.Получатель);
		КонецЕсли;
		МассивПКГС.Добавить(СтруктураДанныхСтроки);
	КонецЦикла;
	Возврат Новый Структура("ПКС, ПКГС",МассивПКС, МассивПКГС);
КонецФункции

&НаКлиенте
Процедура УстановитьДоступность()
	Если ВариантОтображения = 0 ИЛИ ВариантОтображения = 2 Тогда
		Элементы.ФормаАвтосопоставление.Доступность = Истина;
		Элементы.ФормаСоздатьПравилаКонвертацииСвойств.Доступность = Истина;
	Иначе
		Элементы.ФормаАвтосопоставление.Доступность = Ложь;
		Элементы.ФормаСоздатьПравилаКонвертацииСвойств.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСпискиВыбораСвойств()
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(
		Элементы.СопоставлениеСвойствСвойствоКонфигурации, 
		СписокСвойствКонфигурации);
	Если ЭтоКонвертацияXDTO Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(
			Элементы.СопоставлениеСвойствСвойствоФормата, 
			СписокСвойствФормата);
	Иначе
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(
			Элементы.СопоставлениеСвойствСвойствоКонфигурацииКорреспондента, 
			СписокСвойствКонфигурацииКорреспондента);
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСвойства(ИмяСвойства, ИмяТипСвойства, ЗначениеСвойства, ИмяВторогоСвойства)
	Для Каждого СтрокаНесопоставленные Из Объект.СопоставлениеСвойств Цикл
		Если СтрокаНесопоставленные[ИмяСвойства] = ЗначениеСвойства
			И СтрокаНесопоставленные.НомерСтроки <> Элементы.СопоставлениеСвойств.ТекущиеДанные.НомерСтроки Тогда
			ТипСвойства = СтрокаНесопоставленные[ИмяТипСвойства];
			Объект.СопоставлениеСвойств.Удалить(СтрокаНесопоставленные.НомерСтроки -1);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.СопоставлениеСвойств.ТекущиеДанные[ИмяСвойства] = ЗначениеСвойства;
	Элементы.СопоставлениеСвойств.ТекущиеДанные[ИмяТипСвойства] = ТипСвойства;
	
	Если ЗначениеЗаполнено(Элементы.СопоставлениеСвойств.ТекущиеДанные[ИмяВторогоСвойства]) Тогда
		Элементы.СопоставлениеСвойств.ТекущиеДанные.СоздатьПравило = Истина;
	ИначеЕсли Элементы.СопоставлениеСвойств.ТекущиеДанные.СоздатьПравило Тогда
		 Элементы.СопоставлениеСвойств.ТекущиеДанные.СоздатьПравило = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.СопоставлениеСвойствСвойствоКонфигурацииКорреспондента.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.СопоставлениеСвойствТипСвойстваКонфигурацииКорреспондента.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.СопоставлениеСвойствТипСвойстваФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.СопоставлениеСвойствСвойствоФормата.Видимость = ЭтоКонвертацияXDTO;
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Элементы.СопоставлениеСвойствСвойствоКонфигурации.Заголовок = НСтр("ru='Источник'");
		Элементы.СопоставлениеСвойствТипСвойстваКонфигурации.Заголовок = НСтр("ru='Тип источника'");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВерхнийРодительИмя(РодительСсылка)
	ДанныеРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РодительСсылка, "Родитель, Наименование, ТипОбщегоСвойства");
	Если НЕ ЗначениеЗаполнено(ДанныеРодителя.Родитель) Тогда
		Если ДанныеРодителя.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть
			Или ДанныеРодителя.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка() Тогда
			Возврат ДанныеРодителя.Наименование;
		Иначе
			// Может быть группа общих свойств шапки.
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	Возврат ВерхнийРодительИмя(ДанныеРодителя.Родитель);
КонецФункции
#КонецОбласти
